#include"Functions.h"

bool SetShipAuto(int deck, int player)//‘ункци€ установки корабл€
{
	int dir = 0;//–асположение корабл€ 0 - по горизонтали, 1 - по вертикали
	int isset = 0;// орабль установлен успешно
	int y = 0;//—генерированна€ координата Y
	int x = 0;//—генерированна€ координата X
	int trySet = 0;//ћаксимальное количество попыток установить корабль (100)

	while (isset == 0) // ѕроверка удалось ли разместить корабль
	{
		dir = rand() % 2; // ¬ыбираем расположение корабл€ 0 - по горизонтали, 1 - по вертикали

		if (dir == 0)//(0 - игрок)
		{
			y = rand() % 10;
			x = rand() % (10 - deck + 1);
		}
		else if (dir == 1)
		{
			y = rand() % (10 - deck + 1);
			x = rand() % 10;
		}

		if (player == 1) x += 15;//—мещение на карту противника (1 - противник)

		isset = TryingPlacement(deck, dir, x, y);

		trySet++;

		if (trySet >= 1000)//ћаксимальное количество попыток разместить флот
		{
			system("cls");
			cout << "ѕосле " << trySet << " попыток не удалость разместить корабль размером - " << deck << "\n\n";
			Sleep(5000);
			exit(0);
			return false;
		}
	}
	return true;
}
